# 연습: DataFrame 1

In [80]:
#판다스를 가져오기
import pandas as pd
import numpy as np

### 예제 1 
1. Nan이 아닌 부분을 출력하시오.
2. NaN의 값을 0으로 바꾼후 출력하시오.

In [3]:
sdata = {'Ohio': 35000,
         'Texas': 71000,
         'Oregon': 16000,
         'Utah': 5000}

states = ['California', 'Ohio', 'Oregon', 'Texas'] #california is not in sdata
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [147]:
# 예제 1.1
obj4.dropna()

Ohio      35000.0
Oregon    16000.0
Texas     71000.0
dtype: float64

In [148]:
#강사님
obj4.isnull(), obj4.notnull()

(California     True
 Ohio          False
 Oregon        False
 Texas         False
 dtype: bool,
 California    False
 Ohio           True
 Oregon         True
 Texas          True
 dtype: bool)

In [149]:
#강사님
obj4[obj4.notnull()]

Ohio      35000.0
Oregon    16000.0
Texas     71000.0
dtype: float64

In [150]:
# 예제 1.2
obj4.fillna(0)

California        0.0
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [151]:
#강사님
obj4 [obj4.isnull()]=0
obj4

California        0.0
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

### 예제 2

index가 'four'인 행의 값을 [1999, 'Ohio', 3.2, 0]으로 변경하시오.

`columns=['year', 'state', 'pop', 'debt']`

In [214]:
data = [
        [2001,"Seoul",123456789,np.nan],
        [2002,"Busan",12345678,np.nan],
        [2003,"Ohio",1234567,np.nan],
        [2004,"Daejeon",123456,np.nan],                 
        [2002,"Ohio",12345,np.nan]
        ]
data

[[2001, 'Seoul', 123456789, nan],
 [2002, 'Busan', 12345678, nan],
 [2003, 'Ohio', 1234567, nan],
 [2004, 'Daejeon', 123456, nan],
 [2002, 'Ohio', 12345, nan]]

In [215]:
frame = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], #debt는 없으므로 NaN으로 채움
                   index=['one', 'two', 'three', 'four', 'five'],
                    ) #index를 지정해줌

frame

       year    state        pop  debt
one    2001    Seoul  123456789   NaN
two    2002    Busan   12345678   NaN
three  2003     Ohio    1234567   NaN
four   2004  Daejeon     123456   NaN
five   2002     Ohio      12345   NaN

In [216]:
# 예제 2
frame.loc['four'] = ['1999', 'Ohio', '3.2', '0']
frame

C:\Users\selina\AppData\Local\Temp\ipykernel_9196\2443446152.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '1999' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  frame.loc['four'] = ['1999', 'Ohio', '3.2', '0']
C:\Users\selina\AppData\Local\Temp\ipykernel_9196\2443446152.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '3.2' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  frame.loc['four'] = ['1999', 'Ohio', '3.2', '0']
C:\Users\selina\AppData\Local\Temp\ipykernel_9196\2443446152.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  frame.loc['four'] = ['1999', 'Ohio', '3.2', '0']

       year  state        pop debt
one    2001  Seoul  123456789  NaN
two    2002  Busan   12345678  NaN
three  2003   Ohio    1234567  NaN
four   1999   Ohio        3.2    0
five   2002   Ohio      12345  NaN

### 예제 3
위 frame에서 index가 two, column이 state 인 값을 'Nevada'로 변경하시오.

In [217]:
# 예제 3
frame.loc['two', 'state'] =  'Nevada'

In [218]:
frame

       year   state        pop debt
one    2001   Seoul  123456789  NaN
two    2002  Nevada   12345678  NaN
three  2003    Ohio    1234567  NaN
four   1999    Ohio        3.2    0
five   2002    Ohio      12345  NaN

### 예제 4 
위 frame에 year=2002이고 state='Ohio' 일때 True를 갖는 etc 컬럼을 생성하시오.

In [219]:
frame['etc'] = (frame['year']==2002) & (frame['state'] == 'Ohio')
frame

       year   state        pop debt    etc
one    2001   Seoul  123456789  NaN  False
two    2002  Nevada   12345678  NaN  False
three  2003    Ohio    1234567  NaN  False
four   1999    Ohio        3.2    0  False
five   2002    Ohio      12345  NaN   True

### 예제 5 
1. 위 frame에서 one, three, four 행에서 year, state, etc 열만 가져와 frame2에 저장하시오.
2. 수정된 frame2에서 year > 2000, state == Ohio 인 행을 출력 하시오.

In [220]:
# 예제 5.1
frame2= frame.loc[['one','three','four'],['year','state','etc']]
frame2

       year  state    etc
one    2001  Seoul  False
three  2003   Ohio  False
four   1999   Ohio  False

In [212]:
# 예제 5.2
frame2[(frame2['year'].astype(int) > 2000) & (frame2['state']=='Ohio')]

       year state    etc
three  2003  Ohio  False

In [222]:
frame2.loc[(frame2.year.astype(int) > 2000) & (frame2.state == 'Ohio')]

       year state    etc
three  2003  Ohio  False

### 예제 6 
데이터 프레임의 각 행과 열의 합을 각각 계산하여 출력하시오.

In [224]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), #bde 열을 생성
                  index=['Utah', 'Ohio', 'Texas', 'Oregon']) #Utah, Ohio, Texas, Oregon 행을 생성
frame

               b         d         e
Utah   -1.258859  1.118183 -2.001026
Ohio    0.654581 -0.567528 -0.122967
Texas   0.604313 -0.333965  0.122833
Oregon -0.021835  0.340698  0.944787

In [225]:
# 예제 6:열의 합
frame['b'].sum(), frame['d'].sum(), frame['e'].sum()

(-0.02180066591332344, 0.5573884424975182, -1.0563728327772255)

In [226]:
frame.sum()

b   -0.021801
d    0.557388
e   -1.056373
dtype: float64

In [230]:
frame.loc['total'] = frame['b'].sum(), frame['d'].sum(), frame['e'].sum()
frame

               b         d         e
Utah   -1.258859  1.118183 -2.001026
Ohio    0.654581 -0.567528 -0.122967
Texas   0.604313 -0.333965  0.122833
Oregon -0.021835  0.340698  0.944787
total  -0.021801  0.557388 -1.056373

In [231]:
frame.sum(axis = 1)

Utah     -2.141702
Ohio     -0.035915
Texas     0.393181
Oregon    1.263651
total    -0.520785
dtype: float64

In [234]:
# 예제 6: 행의 합
frame['total'] =frame.loc['Utah'].sum(), frame.loc['Ohio'].sum(), frame.loc['Texas'].sum(), frame.loc['Oregon'].sum(), frame.loc['total'].sum()
frame

               b         d         e     total
Utah   -1.258859  1.118183 -2.001026 -2.141702
Ohio    0.654581 -0.567528 -0.122967 -0.035915
Texas   0.604313 -0.333965  0.122833  0.393181
Oregon -0.021835  0.340698  0.944787  1.263651
total  -0.021801  0.557388 -1.056373 -0.520785

### 예제 7
아래 int_frame을 index, column기준으로 정렬하시오. (단, index, column 모두 정렬되어야 함)<br>

In [98]:
int_frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'b', 'c', 'a']) #column 기준 정렬
int_frame

       d  b  c  a
three  0  1  2  3
one    4  5  6  7

In [106]:
# 예제 7
int_frame.sort_index(axis=0).sort_index(axis=1)

       a  b  c  d
one    7  5  6  4
three  3  1  2  0

### 예제 8
코스피와 IBM 가격정보를 불러와 상관관계를 파악하시오.
- 코스피 = '^KS11'
- IBM = 'IBM'
- 애플 = 'APLE'

# 주가 데이터를 불러올 티커 목록
tickers = ['^KS11', 'IBM', 'AAPL', 'GOOGL', 'MSFT', 'TSLA']  # AAPL: 애플, GOOGL: 구글, MSFT: 마이크로소프트, TSLA: 테슬라

In [1]:
#!pip install pandas_datareader
!pip install yfinance

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: yfinance in c:\users\selina\appdata\roaming\python\python312\site-packages (0.2.44)
Requirement already satisfied: pandas>=1.3.0 in c:\anaconda3\lib\site-packages (from yfinance) (2.2.2)
Requirement already satisfied: numpy>=1.16.5 in c:\anaconda3\lib\site-packages (from yfinance) (1.26.4)
Requirement already satisfied: requests>=2.31 in c:\anaconda3\lib\site-packages (from yfinance) (2.32.2)
Requirement already satisfied: multitasking>=0.0.7 in c:\users\selina\appdata\roaming\python\python312\site-packages (from yfinance) (0.0.11)
Requirement already satisfied: lxml>=4.9.1 in c:\anaconda3\lib\site-packages (from yfinance) (5.2.1)
Requirement already satisfied: platformdirs>=2.0.0 in c:\anaconda3\lib\site-packages (from yfinance) (3.10.0)
Requirement already satisfied: pytz>=2022.5 in c:\anaconda3\lib\site-packages (from yfinance) (2024.1)
Requirement already satisfied: frozendict>=2.3.4 in c:\anaconda3\lib\site-packages (from yfinance) (2.4.2)
Requirement already satisfied: peewee>=3.16.2 in c:\users\selina\appdata\roaming\python\python312\site-packages (from yfinance) (3.17.6)
Requirement already satisfied: beautifulsoup4>=4.11.1 in c:\anaconda3\lib\site-packages (from yfinance) (4.12.3)
Requirement already satisfied: html5lib>=1.1 in c:\users\selina\appdata\roaming\python\python312\site-packages (from yfinance) (1.1)
Requirement already satisfied: soupsieve>1.2 in c:\anaconda3\lib\site-packages (from beautifulsoup4>=4.11.1->yfinance) (2.5)
Requirement already satisfied: six>=1.9 in c:\anaconda3\lib\site-packages (from html5lib>=1.1->yfinance) (1.16.0)
Requirement already satisfied: webencodings in c:\anaconda3\lib\site-packages (from html5lib>=1.1->yfinance) (0.5.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\anaconda3\lib\site-packages (from pandas>=1.3.0->yfinance) (2.9.0.post0)
Requirement already satisfied: tzdata>=2022.7 in c:\anaconda3\lib\site-packages (from pandas>=1.3.0->yfinance) (2023.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (3.7)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (2.2.2)
Requirement already satisfied: certifi>=2017.4.17 in c:\anaconda3\lib\site-packages (from requests>=2.31->yfinance) (2024.8.30)

In [2]:
python -m pip install --upgrade yfinance

SyntaxError: invalid syntax (2982311666.py, line 1)

In [3]:
pip show yfinance

Name: yfinance
Version: 0.2.44
Summary: Download market data from Yahoo! Finance API
Home-page: https://github.com/ranaroussi/yfinance
Author: Ran Aroussi
Author-email: ran@aroussi.com
License: Apache
Location: C:\Users\selina\AppData\Roaming\Python\Python312\site-packages
Requires: beautifulsoup4, frozendict, html5lib, lxml, multitasking, numpy, pandas, peewee, platformdirs, pytz, requests
Required-by:
Note: you may need to restart the kernel to use updated packages.

In [316]:
!pip install -- upgrade yfinance

Defaulting to user installation because normal site-packages is not writeable

ERROR: Could not find a version that satisfies the requirement upgrade (from versions: none)
ERROR: No matching distribution found for upgrade

In [4]:
# 예제 8
# from pandas_datareader import data as web
# all_data = {}
# for ticker in ['^KS11', 'IBM']:
#     all_data[ticker] = web.get_data_yahoo(ticker)

# price = DataFrame({tic: data['Adj Close']
#                    for tic, data in all_data.items()})

import yfinance as yf
import pandas as pd

tickers = ['^KS11', 'IBM', 'AAPL', 'GOOGL', 'MSFT', 'TSLA']
all_data = {}

# Yahoo Finance 데이터를 가져옴
for ticker in tickers:
    all_data[ticker] = yf.download(ticker)

all_data

# 종가 데이터를 추출하여 DataFrame 생성
price = pd.DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})
price
# 상관계수 계산
#print(price.corr())

price.corr()

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

          ^KS11       IBM      AAPL     GOOGL      MSFT      TSLA
^KS11  1.000000  0.852148  0.722645  0.815326  0.683060  0.821418
IBM    0.852148  1.000000  0.718863  0.728847  0.721156  0.471351
AAPL   0.722645  0.718863  1.000000  0.976825  0.988753  0.926383
GOOGL  0.815326  0.728847  0.976825  1.000000  0.982374  0.900297
MSFT   0.683060  0.721156  0.988753  0.982374  1.000000  0.889371
TSLA   0.821418  0.471351  0.926383  0.900297  0.889371  1.000000

In [328]:
####################
import yfinance as yf
import pandas as pd

tickers = ['^KS11', 'IBM', 'AAPL', 'GOOGL', 'MSFT', 'TSLA']
all_data = {}

# Yahoo Finance 데이터를 가져옴
for ticker in tickers:
    #all_data[ticker] = yf.download(ticker)
    data_temp = yf.download(ticker)
    print (data_temp.columns)
    
    if not data_temp.empty :
        data_temp.columns = data_temp.columns.droplevel(1)
        all_data[ticker] = data_temp

#all_data

# 종가 데이터를 추출하여 DataFrame 생성
price = pd.DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})
price

# 상관계수 계산
#print(price.corr())

price_corr = price.corr()
price_corr

[*********************100%***********************]  1 of 1 completed

Index(['Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume'], dtype='object')

IndexError: Too many levels: Index has only 1 level, not 2

Empty DataFrame
Columns: []
Index: []

### 예제 9
1. 2~3행에서 '0'컬럼을 None으로 변경 하시오.
2. 0~2행에서 '2'컬럼을 None으로 변경하시오.
3. 각 컬럼의 None값들을 각 컬럼의 평균값으로 채우시오.

In [285]:
# 예제 9.1 2~3행에서 '0'컬럼을 None으로 변경 하시오.

price_corr1 = price_corr.iloc[1:3,[0]].ashtype('object') = 'None'
price_corr1

SyntaxError: cannot assign to function call (859047902.py, line 3)

In [282]:
# 예제 9.2 0~2행에서 '2'컬럼을 None으로 변경하시오.
price_corr3 = price_corr.iloc[:3, 2] = 'None'
price_corr3

C:\Users\selina\AppData\Local\Temp\ipykernel_9196\655325573.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'None' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  price_corr3 = price_corr.iloc[:3, 2] = 'None'

'None'

In [ ]:
# 예제 9.3 각 컬럼의 None값들을 각 컬럼의 평균값으로 채우시오.

### 예제 10
1. multi_idx 이름으로 0 ~ 20의 값을 갖는 (5,4) 데이터 프레임을 생성하시오.
  - index 상위 색인: a, a, b, b, c
  - index 하위 색인: 1,2, 1, 2, 1
  - columns 상위 색인: 'KOR', 'KOR', 'USA', 'USA'
  - columns 하위 색인: 'Seoul', 'Busan', 'LA', 'NewYork'
2. index=b, column= KOR의 Seoul에 해당하는 값을 출력하시오.

In [140]:
# 예제 10.1
multi_idx = np.arange(0,20).reshape(5,4)
multi_idx

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [143]:
# 예제 10.2
multi_idx= pd.DataFrame(multi_idx)
multi_idx

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [146]:
multi_idx.set_index('a', 'a', 'b', 'b', 'c')
multi_idx

TypeError: DataFrame.set_index() takes 2 positional arguments but 6 were given

### 예제 11
1. 위 데이터프레임에 index(key1, key2), column(Country, Region)의 이름을 설정하시오.
2. 2번째 index로 데이터 프레임을 정렬 하시오.
3. column의 레벨을 바꾸시오.

In [ ]:
# 예제 11.1

In [ ]:
# 예제 11.2

In [ ]:
# 예제 11.3

---

In [ ]:
# end of file